src/DataProcessors/ОбменДаннымиСТопЛог_Регламент_Статусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОбменДаннымиСТопЛог_Регламент_Статусы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/НастройкиРеквизитовДляОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НастройкиРеквизитовДляОбменов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрокаДляРабочейБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаДляТестовойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлДляРабочейБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлДляТестовойБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДляРабочейБазы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДляТестовойБазы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ОбменДаннымиСТопЛог_Регламент_Статусы/Ext/ObjectModule.bsl
//#Если Сервер тогда
	
	Перем мАдресВебСервиса;
	
	Процедура ВыполнитьРегламентноеЗадание() Экспорт
		
		//Если НЕ ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза() тогда
			//ВызватьИсключение "Данная операция выполняется только в рабочей информационной базе.";		
		//КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ИдентификаторУзлаОбмена) тогда
			ВызватьИсключение "Не заполнен реквизит ""Узел обмена"".";		
		КонецЕсли;
		
		//Семенов И.П. 07.02.2019 XX-1768(
		Попытка
		//)Семенов И.П.
			лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog_РТУ;
			лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
			
			лПолучатель = лМенеджерПланаОбмена.ЭтотУзел();
			лКодПолучателя = Число(лПолучатель.ИдентификаторУзла);
			
			лОтправитель = ОбменДаннымиКлиентСервер.ПолучитьВходящийУзелОбмена(лМетаданныеПланаОбмена, ИдентификаторУзлаОбмена);
			лКодОтправителя = лОтправитель.ИдентификаторУзла;
			лНомерПринятого = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(лОтправитель, "НомерПринятого");
			
			
			лОпределения = Новый WSОпределения(мАдресВебСервиса);
			лПрокси = Новый WSПрокси(лОпределения, лОпределения.Сервисы[0].URIПространстваИмен,
			лОпределения.Сервисы[0].Имя, лОпределения.Сервисы[0].ТочкиПодключения[0].Имя);
			
			лОтветСервера = лПрокси.GetExchangeMessage(лМетаданныеПланаОбмена.Имя, лКодПолучателя, лНомерПринятого);
			
			лСообщениеОбмена = лОтветСервера;
			ТекстСообщения = лОтветСервера;
			
			// без этого на сервере не работает почему то
			лТекстовыйДокумент = Новый ТекстовыйДокумент;
			лТекстовыйДокумент.УстановитьТекст(лСообщениеОбмена);
			лСообщениеОбмена = лТекстовыйДокумент.ПолучитьТекст();
		//Семенов И.П. 07.02.2019 XX-1768(
		Исключение
		    ТекстОшибки = ОписаниеОшибки();
		   	ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,ПланыОбмена.ОбменПартКом83_TopLog_РТУ.ПустаяСсылка(),"",,Истина,ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		//)Семенов И.П.
		лМенеджерПланаОбмена.ЗагрузитьСообщениеОбмена(лСообщениеОбмена);
		лУпаковщик = Неопределено;
		
	КонецПроцедуры
	Если ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза() Тогда 
		мАдресВебСервиса = Справочники.НастройкиРеквизитовДляОбменов.Обмен_1С_ТопЛог.СтрокаДляРабочейБазы;
	Иначе
		мАдресВебСервиса = Справочники.НастройкиРеквизитовДляОбменов.Обмен_1С_ТопЛог.СтрокаДляТестовойБазы;
	КонецЕсли;
	
//#КонецЕсли
